app/views/students/index.html.erb

SELECT COUNT(*) FROM `students`  WHERE (ProgStatus in ('Candidate','Prospective') and EnrollmentStatus='Active Student')
SELECT `students`.* FROM `students`  WHERE (ProgStatus in ('Candidate','Prospective'))
---
                  <!--          <span class="badge">-->
                  <!--            <%#=student.student_files.active.size%>-->