app/views/praxis_results/test_details.html.erb


      <% if @test.praxis_subtest_results.size > 0 %>
---
SELECT COUNT(*) FROM `praxis_subtest_results`  WHERE `praxis_subtest_results`.`praxis_results_TestID` = 'B00651430-5730-4/26/2013'
SELECT `praxis_subtest_results`.* FROM `praxis_subtest_results`  WHERE `praxis_subtest_results`.`praxis_results_TestID` = 'B00651430-5032-5/15/2015'