app/controllers/clinical_assignments_controller.rb

SELECT `clinical_assignments`.* FROM `clinical_assignments`  WHERE `clinical_assignments`.`Term` = 201511
---
  def index
    term_menu_setup
    @assignments = ClinicalAssignment.where(Term: @term).select {|a| can? :read, a }    #get records user can read