app/controllers/praxis_results_controller.rb

SELECT  `praxis_results`.* FROM `praxis_results`  WHERE `praxis_results`.`TestID` = 'B00651430-5032-5/15/2015' LIMIT 1
SELECT  `students`.* FROM `students`  WHERE `students`.`Bnum` = 'B00651430' LIMIT 1
---
  def test_details
    #show details on test including subtests
    @test = PraxisResult.find(params[:id])
    @student = Student.find(@test.Bnum)

SELECT `students`.* FROM `students`  WHERE (ProgStatus in ('Candidate','Prospective') and EnrollmentStatus='Active Student')
SELECT `praxis_tests`.* FROM `praxis_tests`  WHERE (CurrentTest=1)
---
  def new
    #for clerical users to enter a new praxis exam when a student registers.
    @test = PraxisResult.new
    @students = Student.all.current.by_last
    @test_options = PraxisTest.all.current