app/controllers/praxis_results_controller.rb

  def show
    #show details on test including subtests
    @test = PraxisResult.find params[:id]
---
SELECT  `praxis_results`.* FROM `praxis_results`  WHERE `praxis_results`.`TestID` = 'B00651430-5032-5/15/2015' LIMIT 1