app/controllers/students_controller.rb

  def index
    all_students = Student.all.by_last

    if (params[:all]) == "true"
      # display all students I have access to
      @students = all_students.select{|s| can? :read, s}
    elsif (params[:search]).present?
      # display students resulting from search
      query = Student.with_name(params[:search])
      @students = all_students.joins(:last_names).where(query).select{|s| can? :read, s}
    else # no params given
      # display only active and current students
      @students = all_students.active_student.current.select{|s| can? :read, s}
---
SELECT `students`.* FROM `students`  WHERE (ProgStatus in ('Candidate','Prospective'))
SELECT `students`.* FROM `students`  WHERE (ProgStatus in ('Candidate','Prospective') and EnrollmentStatus='Active Student')  ORDER BY `students`.`LastName` DESC